Домашняя работа №1.1 (Pandas)
В городе SQL произошло убийство! SQL Murder Mystery - это одновременно и самостоятельный урок для изучения концепций и команд SQL, и увлекательная игра для опытных пользователей SQL, в которой нужно раскрыть интригующее преступление. Произошло преступление, и детективу нужна ваша помощь. Детектив дал вам отчет о месте преступления, но вы каким-то образом потеряли его. Вы смутно помните, что преступление было убийством, произошедшим 15 января 2018 года, и что оно произошло в SQL City. Начните с поиска соответствующего отчета о месте преступления в базе данных полицейского управления.

Импорты

In [1]:
import pandas as pd
from datetime import datetime

Загрузить каждый отчет

In [2]:
# path prefix
data_path = './data_pandas/'
crime_scene_report = pd.read_csv(data_path + 'crime_scene_report.csv')
crime_scene_report.head()

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City

In [3]:
drivers_license = pd.read_csv(data_path + 'drivers_license.csv')
drivers_license.head()

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,100280,72,57,brown,red,male,P24L4U,Acura,MDX
1,100460,63,72,brown,brown,female,XF02T6,Cadillac,SRX
2,101029,62,74,green,green,female,VKY5KR,Scion,xB
3,101198,43,54,amber,brown,female,Y5NZ08,Nissan,Rogue
4,101255,18,79,blue,grey,female,5162Z1,Lexus,GS

In [4]:
facebook_event_checkin = pd.read_csv(data_path + 'facebook_event_checkin.csv')
facebook_event_checkin.head()

,person_id,event_id,event_name,date
0,28508,5880,Nudists are people who wear one-button suits.\n,20170913
1,63713,3865,but that's because it's the best book on anyth...,20171009
2,63713,3999,"If Murphy's Law can go wrong, it will.\n",20170502
3,63713,6436,Old programmers never die. They just branch t...,20170926
4,82998,4470,Help a swallow land at Capistrano.\n,20171022

In [5]:
get_fit_now_check_in = pd.read_csv(data_path + 'get_fit_now_check_in.csv')
get_fit_now_check_in.head()

  membership_id  check_in_date  check_in_time  check_out_time
0         NL318       20180212            329             365
1         NL318       20170811            469             920
2         NL318       20180429            506             554
3         NL318       20180128            124             759
4         NL318       20171027            418            1019

In [6]:
get_fit_now_member = pd.read_csv(data_path + 'get_fit_now_member.csv')
get_fit_now_member.head()

,id,person_id,name,membership_start_date,membership_status
0,NL318,65076,Everette Koepke,20170926,gold
1,AOE21,39426,Noe Locascio,20171005,regular
2,2PN28,63823,Jeromy Heitschmidt,20180215,silver
3,0YJ24,80651,Waneta Wellard,20171206,gold
4,3A08L,32858,Mei Bianchin,20170401,silver

In [7]:
income = pd.read_csv(data_path + 'income.csv')
income.head()

         ssn  annual_income
0  100009868          52200
1  100169584          64500
2  100300433          74400
3  100355733          35900
4  100366269          73000

In [8]:
interview = pd.read_csv(data_path + 'interview.csv')
interview.head()

   person_id                                         transcript
0      28508                ‘I deny it!’ said the March Hare.\n
1      63713                                                 \n
2      86208      way, and the whole party swam to the shore.\n
3      35267  lessons in here? Why, there’s hardly room for ...
4      33856                                                 \n

In [9]:
person = pd.read_csv(data_path + 'person.csv')
person.head()

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684

Только нужные убийства

In [10]:
needed_reports = crime_scene_report[
    (crime_scene_report['date'] == 20180115) &
    (crime_scene_report['type'] == 'murder') &
    (crime_scene_report['city'].str.contains('SQL City', case=False, na=False))
]
needed_reports

,date,type,description,city
1227,20180115,murder,Security footage shows that there were 2 witne...,SQL City

Отчет

In [11]:
needed_reports.iloc[0, 2]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

Найти двух людей из базы данных:

1. Живет в последнем доме на улице "Northwestern Dr"
2. Аннабель, живет где-то на "Franklin Ave"

In [12]:
first_person = person[
    person['address_street_name'] == 'Northwestern Dr'
].sort_values(by='address_number', ascending=True).iloc[-1]
first_person

id                               14887
name                    Morty Schapiro
license_id                      118009
address_number                    4919
address_street_name    Northwestern Dr
ssn                          111564949
Name: 499, dtype: object

In [13]:
second_person = person[
    (person['address_street_name'] == 'Franklin Ave') &
    (person['name'].str.contains('Annabel'))
]
second_person

,id,name,license_id,address_number,address_street_name,ssn
665,16371,Annabel Miller,490173,103,Franklin Ave,318771143

Ищем интервью с этими людьми по их id-шника

In [14]:

print(f'Morty said:\n\t"{interview[interview["person_id"] == 14887].iloc[0, 1]}"\n')
print(f'Annabel said:\n\t"{interview[interview["person_id"] == 16371].iloc[0, 1]}"\n')

Morty said:
	"I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W"."

Annabel said:
	"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

Что нашли

- Мужчина
- Ходит в зал "Get Fit Now Gym"
- Номер сумки начинается на 48Z
- Номермашины имеет H42W.
- Был в зале 9 января

Ищем

In [15]:
suspected_members = get_fit_now_member[
    (get_fit_now_member['id'].str.contains('48Z')) &
    (get_fit_now_member['membership_status'] == 'gold')
]
suspected_members

        id  person_id           name  membership_start_date membership_status
181  48Z7A      28819   Joe Germuska               20160305              gold
182  48Z55      67318  Jeremy Bowers               20160101              gold

In [16]:
licenses = drivers_license[
    (drivers_license['plate_number'].str.contains('H42W')) &
    (drivers_license['gender'] == 'male')
]
licenses

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
3529,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
6240,664760,21,71,black,black,male,4H42WR,Nissan,Altima

Проверяем интервью Аннабель

In [17]:
gym_suspects = pd.merge(
    suspected_members, get_fit_now_check_in, left_on='id', right_on='membership_id', how='inner'
)
gym_suspects

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time
0,48Z7A,28819,Joe Germuska,20160305,gold,48Z7A,20180109,1600,1730
1,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700

Оба были в зале в один день с Аннабель. Смотрим их интервью

In [18]:
interviews = interview[interview['person_id'].isin(gym_suspects['person_id'].to_list())]
interviews
interviews.iloc[0, 1]

'I was hired by a woman with a lot of money. I don\'t know her name but I know she\'s around 5\'5" (65") or 5\'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n'

Агрегируем информацию

In [19]:
person_info = pd.merge(person, licenses, left_on='license_id', right_on='id', how='inner')
full_person_info = pd.merge(person_info, income, left_on='ssn', right_on='ssn', how='inner')
full_person_info

,id_x,name,license_id,address_number,address_street_name,ssn,id_y,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model,annual_income
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS,10500

**Ответ - убийца Джереми Боуэрс**

Проверяем кто заказчик

In [20]:
customers_licenses = drivers_license[
    ((drivers_license['height'] >= 65) & (drivers_license['height'] <= 67)) &
    (drivers_license['hair_color'] == 'red') &
    (drivers_license['car_make'] == 'Tesla') &
    (drivers_license['car_model'] == 'Model S')
]
customers = person[person['license_id'].isin(customers_licenses['id'].to_list())]
facebook_event_checkin[
    (facebook_event_checkin['event_name'].str.contains('SQL Symphony Concert')) &
    (facebook_event_checkin['person_id'].isin(customers['id'].to_list()))
]

       person_id  event_id            event_name      date
20006      99716      1143  SQL Symphony Concert  20171206
20007      99716      1143  SQL Symphony Concert  20171212
20008      99716      1143  SQL Symphony Concert  20171229

**Ответ 2 - заказчик убийства Миранда Пристли**